%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Программа для демонстрации случайных %
% блужданий и гистограммы распределения частиц %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Инициализация параметров
n = 500; 
dh = 0.02; 
y = 1:n; 
y = y';
x = zeros(size(y)); 

% Создание фигуры и осей для анимации
figure;
subplot(2,1,1);
h1 = plot(x, y, 'k.'); 
axis([-2 2 0 n+1]); 
set(h1, 'EraseMode', 'background', 'MarkerSize', 3); 
% В методичке написано использовать EraseMode, но в
% новых версиях MATLAB это не обязательно, но я оставил, ибо и так работает.

% Создание осей для гистограммы
subplot(2,1,2);
h2 = histogram(x, 'Normalization', 'pdf'); % Инициализация гистограммы
hold on;
xmin = -2; xmax = 2;
x_values = linspace(xmin, xmax, 100);
f = @(x) 1/(sqrt(2*pi*n*dh^2)) * exp(-x.^2/(2*n*dh^2)); % Теоретическая функция
plot(x_values, f(x_values), 'r'); % Распределение Гаусса
hold off;
axis([xmin xmax 0 1]);

pause; % Пауза для вывода графика на экран

% Бесконечный цикл для анимации
while true
    x = x + dh*(2*rand(n,1)-1); 
    set(h1, 'XData', x, 'YData', y, 'Color', 'k'); 
    h2.Data = x; % Обновление данных гистограммы
    %%% % Обновление границ осей гистограммы
    %%% xmin = min(x); xmax = max(x);
    %%% axis([xmin xmax 0 1]);
    drawnow; % Принудительное обновление графика
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%